package Car;

/*
Закрепить материал по классам и объектам.
Создать проект в идее, в нем создать класс Car (цвет, марка, пробег, автомат или нет).
В этом классе сделать конструктор со всеми параметрами.
В классе Car должны быть след методы по взаимодействию:
печатать всю инфу, увеличить пробег на заданную величину.

Создать класс Person (имя, возраст, национальность, есть права или нет, авто).
Создать конструктор с параметрами (имя, возраст, нац, права).
Методы класса Person: напечетать всю инфу,
метод принимает принимет авто и проверяет есть ли права у человека,
если есть - назначает ему это авто.

Для тестирования - созд новый класс Test, в нем - psvm.
И там поупражняться в создании объектов,
вызове методов, взаимодействии объхектов.
*/


public class Car {
}
